'''
_______________#########_______________________ 
______________############_____________________ 
______________#############____________________ 
_____________##__###########___________________ 
____________###__######_#####__________________ 
____________###_#######___####_________________ 
___________###__##########_####________________ 
__________####__###########_####_______________ 
________#####___###########__#####_____________ 
_______######___###_########___#####___________ 
_______#####___###___########___######_________ 
______######___###__###########___######_______ 
_____######___####_##############__######______ 
____#######__#####################_#######_____ 
____#######__##############################____ 
___#######__######_#################_#######___ 
___#######__######_######_#########___######___ 
___#######____##__######___######_____######___ 
___#######________######____#####_____#####____ 
____######________#####_____#####_____####_____ 
_____#####________####______#####_____###______ 
______#####______;###________###______#________ 
________##_______####________####______________ 

Author: Gakki && 739150373@qq.com
Date: 2024-01-08 18:27:21
LastEditors: Gakki
LastEditTime: 2024-03-18 21:17:12
Description: 桌游机器人梨花酱(KOOK版)
联系QQ:739150373
'''




from khl import Bot, Cert
import logging
import json
import boardgame

# 用 json 读取 config.json，装载到 config 里
# 注意文件路径，要是提示找不到文件的话，就 cd 一下工作目录/改一下这里
with open('.\\config\\config.json', 'r', encoding='utf-8') as f:
    config = json.load(f)

# 初始化bot 
bot = Bot(token=config['token']) # 默认采用 websocket
if not config['using_ws']:  # webhook
    # 当配置文件中'using_ws'键值为false时，代表不使用websocket
    # 此时采用webhook方式初始化机器人
    print(f"[BOT] using webhook at port {config['webhook_port']}")
    bot = Bot(cert=Cert(token=config['token'],
                        verify_token=config['verify_token'],
                        encrypt_key=config['encrypt_token']),
              port=config['webhook_port'])
    
# 调用支线文件test.py中的init函数来注册命令
@bot.on_startup
async def bot_init(bot: Bot):
	boardgame.init(bot) 

# ============运行===============
# 查看输出
logging.basicConfig(level='INFO')

# 运行机器人
# if __name__ == '__main__':
bot.run() 

